Tekla Open API Reference for Tekla Structures 2025
BasePoint.IsProjectBasePoint Property
 Gets or sets the value indicating if this base point is the project base point.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool IsProjectBasePoint { get; set; }
Public Property IsProjectBasePoint As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
BasePoint Class
Tekla.Structures.Model Namespace